#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//操作符
int main() {
	//算术操作符 + - * / %
	/*
	int a = 5 / 2;//取商2
	int b = 5 % 2;//取模1
	printf("%d\n",a);
	printf("%d\n", b);
	*/
	//移（2进制位）位操作符  <<左移 >>右移
	/*
	int c = 1;//整型1占4个字节-32个bit位  00000000000000000000000000000001
	int d = c << 1;//00000000000000000000000000000010
	int e = c << 2;//00000000000000000000000000000100
	printf("%d\n",d);//输出为2
	printf("%d\n",e);//输出为4
	printf("%d\n",c);//c的值不改变1
	*/
	//位（2进制位）操作符 &按位与 |按位或 ^按位异或
	/*
	int f = 3;//011
	int g = 5;//101
	int i = f & g;//0假1真,同真即真,001
	int j = f | g;//有一个为真即真，111
	int k = f ^ g;//对应二进制相同为0，相异为1，110
	printf("%d\n", i);//输出为1
	printf("%d\n", j);//输出7
	printf("%d\n", k);//输出6
	*/
	//赋值操作符
	int l = 10;
	l = 20;//  =赋值  ==判断相等
	l = l + 10;//l += 10;复合赋值符<<=  >>=  |=  ^=
	l = l - 10;//l-=10;
	l = l & 2;//l &=2;
	//单目操作符--一个操作数  ！逻辑反操作符 - + &取地址 sizeof计算的是变量/类型所占空间的大小，单位是字节(三种写法)
	//~对一个数的二进制按位取反 前置后置--  前置后置++  *间接访问操作符（解引用操作符）  （类型）强制类型转换
	int arr[10] = { 0 };//10个整型元素的数组 大小 10*sizeof(int)=40 数组类型int[6]
	int sz = 0;
	printf("%d\n", sizeof(arr));//40
	//计算数组的元素个数  个数=数组总大小/每个元素的大小
	sz = sizeof(arr) / sizeof(arr[0]);//6
	printf("sz=%d\n", sz);//10
	int m = 10;
	int n = 0;
	int o = -1;
	int p = -o;
	int q = +6;//+都会省略
	printf("%d\n", m);//10  
	printf("%d\n", !m);//假0 c语言中0-假  非0-真
	printf("%d\n", !n);//真1
	printf("%d\n",sizeof(m));//4
	printf("%d\n",sizeof(int));//4
	printf("%d\n", sizeof m);
	//~对一个数的二进制按位取反
	int r = 0;//4个字节 32bite 00000000000000000000000000000000
	int s = ~r;// s 有符号的整型 最高位时符号位 1为负数 0为正数 ~按（二进制）位取反11111111111111111111111111111111
	//原码(直接按照正负写出的二进制序列) 反码（原码符号位不变 其他位按位取反） 补码（反码加一）
	//1 负数 整数在内存中存储的是二进制的补码（对于正数来说 原码补码反码相同）
	//11111111111111111111111111111111补码
	//11111111111111111111111111111110反码
	//10000000000000000000000000000001原码 
	//-2
	//10000000000000000000000000000010 - 原码
	//11111111111111111111111111111101 - 反码
	//11111111111111111111111111111110 - 补码
	printf("%d\n",s);//-1 打印的是这个数的原码
	//前置后置++
	/*
	int t = 10;
	int w = 10;
	int u = t++;//后置++  先使用,再自增++
	int v = ++w;//前置++  再自增++,先使用
	printf("t = %d u = %d w = %d v = %d\n",t,u,w,v);//t=11 u=10 w=11 v=11
	*/
	//前置后置--
	int t = 10;
	int w = 10;
	int u = t--;//后置--  先使用,再自增--
	int v = --w;//前置--  再自增--,先使用
	printf("t = %d u = %d w = %d v = %d\n", t, u, w, v);//t=9 u=10 w=9 v=9
	int x = (int)3.14;//double --> int
	printf("x = %d\n",x);//x=3一般不建议使用
	return 0;
}

