#define _CRT_SECURE_NO_WARNINGS 1
//操作符-移位操作符  >>右移  <<左移  操作数只能是整数

//>>右移：
//1.算术右移:右边丢弃，左边补原符号位（0 正 1负）
//1.逻辑右移:右边丢弃，左边补0

//<<左移：左边丢弃，右边补0
//右移 除以2  左移 乘以2
#include<stdio.h>
int main()
{
	int a = -1;
	//整数的二进制表示方式：原码、反码、补码
	//存储的内存中是补码
	//正整数三种方式相同
	//10000000000000000000000000000001-原码
	//11111111111111111111111111111110-反码（符号位不变，其余按位取反）
	//11111111111111111111111111111111-补码（反码加一）
	int b = a >> 1;//右移 移动的是二进制位
	printf("%d\n",b);//-1 算术右移（通常）
	int c = 16;//00000000000000000000000000010000
	int d = c >> 1;
	printf("%d\n", d);//8

	int x = 5;//00000000000000000000000000000101
	int y = x << 1;//左移  00000000000000000000000000001010
	printf("%d\n", y);//10

	/*
	int m = 5;
	int n = m >> -1;//error
	printf("%d\n", n);
	*/
	//对于移位运算符，不要移动负数位，这个是标准未定义的。

	return 0;
}