#define _CRT_SECURE_NO_WARNINGS 1
//表达式求值-求值的顺序一部分是由操作符的优先级和结合性决定
//有些表达式的操作数在求值的过程中可能需要转换为其他类型
//表达式中的字符和短整型操作数在使用之前被转换为普通整型
//表达式中各种长度可能小于int长度的整型值,都必须先转换为int或unsigned int,
//然后才能送入CPU去执行运算
#include<stdio.h>
int main()
{
	//隐式类型转换
	//整形提升是按照变量的数据类型的符号位来提升的
	
	//无符号整形提升，高位补0
	char a = 3;//char 存放一个字节8bit 一个字节
	//00000000000000000000000000000011-原码、反码、补码（补码）
	//00000011 - a 真正存放
	char b = 127;//有符号数
	//00000000000000000000000001111111
	//01111111 - b  

	//a和b如何相加
	//整形提升是按照变量的数据类型的符号位来提升的
	//00000011   高位0表示符号位 高位通通补0  (如果为负数 高位补1)
	//00000000000000000000000000000011 
	//01111111
	//00000000000000000000000001111111
	//00000000000000000000000010000010 相加
	//10000010 - c

	char c = a + b;
	//11111111111111111111111110000010 - 补码
	//11111111111111111111111110000001 - 反码
	//10000000000000000000000001111110 - 原码  -126
	printf("%d\n", c);//-126
	return 0;
}